<?php
// ================================

$root = $_SERVER['DOCUMENT_ROOT'];
$root_true = '/home/s1323/';

$a =  str_replace($root_true, '', $root);

$b = 'lapous.com.ua';
$www = 'http://lapous.com.ua/articles';
// ==================================
// Кнопка заказа звонка
// $battCall = '<form method="link" action="http://oscar-vet.kiev.ua/call_request/call_request.php">
//     <input id="call" type="submit" value="     Заказать звонок">
//     </form>';
// =======================================
// Ветеринарная клиника "Лапоус"
$vetPomText = '<h3>Ветеринарная клиника "Лапоус"</h3>
Скорая помощь, диагностика, лечение, профилактика.<br>
 Кастрация/стерилизация.<br>
 Анализы крови, мочи, кала. <br>
 Анализы на инфекции методом ПЦР, ИХА и ИФА.<br>
 Консультации. <br>
 Вакцинация (прививки), хирургические манипуляции любого уровня. <br> 
 Вызов на дом. <br>

<br><br><br>';
// ============================================