<?

// Ветеринарная помощь на дому
$vetPomText = '<h3>Ветеринарная помощь на дому</h3> - скорая помощь, диагностика,вызов на дом, лечение, профилактика.<br>
 Кастрация/стерилизация.<br>
 Анализы крови, мочи, кала. <br>
 Анализы на инфекции методом ПЦР, ИХА и ИФА.<br>
 Консультации. <br>
 Качественно проведем вакцинацию (прививки), кастрацию или стерилизацию Вашего питомца с выездом на дом, хирургические манипуляции любого уровня. <br>
<p><strong>Вам не нужно будет волноваться по поводу стресса животного, связанного с посещением клиники - доктор приедет  к вам на дом </p></strong>
<br><br><br>';

?>