<?php
//так всегда начинается php код(файл)
//=====================================================

header('Content-Type: text/html; charset=utf-8');
// теперь можно писать на русском без кракозяблов
//======================================================

ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
// так отображаются все ошибки
//=======================================================

include('includes/db.php');




$connection = mysqli_connect( '127.0.0.1', 'root', '' , 'veterinarnaja_baza') or die("Нет соединения"); 
// подключение к базе с паролем и логином и паролем
// ("127.0.0.1", "my_user", "my_password", "my_db");
//=======================================================

mysqli_set_charset($connection, 'utf8');  
// исправляет баг с русским шрифтом от базы 
//=======================================================

   

// $_GET - переменная = суперглобальный массив (ее создает php)
// - принимает параметры с формы, которые пришли методом GET
//==========================================================
// $_POST - переменная = суперглобальный массив (ее создает php)
// - принимает параметры с формы, которые пришли методом POST



//---------------------------------------------
$last_name  = $_POST['last_name'];
$first_name = $_POST['first_name'];

mysql_select_db($connection);


$count = mysqli_query($connection, "INSERT INTO `customers` WHERE `last_name` = $last_name, `first_name` = $first_name " );





 
//================================
// if( mysqli_num_rows($count) == 0)
//{
//	echo 'Вы не зарегистрированы!';
//} else 
//{
//	echo 'Привет,' . $login . '!';
//}