Теги комментариев

Комментарии в HTML на простом примере:

<!DOCTYPE HTML>
<html>
<title>Комментарий в html коде</title> 
<body>
<!--Создадим параграф-->
<p>Также комментарии могут содержать инструкции к программным сценариям.</p>
</body>
</html>
Комментарии служат ориентиром внутри исходного кода – комментируют участки кода, при этом, они не видны в браузере.

Результат:

Также комментарии могут содержать инструкции к программным сценариям.

В XHTML используются аналогичные теги для комментариев.