Оператор - нечто, что принимает 1 или больше значений и вычисляет новое значение.

Операнды - числа, с которыми 'оператор' проводит 'операцию'

1 - оператор суммы "+" - оператор сложения
print(2+3); //выведет 5
"2" и "3" - операнды
"+" - оператор
"5" - вычисляемое значение операции

2 - оператор присваивания "+"
$a = 5;
$a = $a + 5;
 - операндами тут являются значение, кот. нах. с обоих сторон оператора равно
 -- в 1-й строке - это "5" и "$a" - рез. работы операции присваивания будет запись в переменную $a значение "5"
 -- во 2-й строке сначала происходит выполнение оператора суммы $a+5(=10) а после в $a записывается значение 10