<?php

$a = 5;
$a = $a + 5;
echo $a;
//выведет 10
echo '<br>';


$b = 7;
$b +=5;
echo $b;
//выведет 10 - т.к. "$b +=5" идентично "$b = $b+5", но запись короче
echo '<br>';


$c = 11;
$c -= 6;
echo $c, '<br>';
//выведет 11,- "$c -= 6" идент. "$c = $c-6"

$d = 7;
$d*=3;
echo $d, '<br>';
//выведет 21,- "$d*=3" идент. "$d = $d*3"


$e = 15;
$e/=3;
echo $e, '<br>';
//выведет 5,- "$e/=3" идент. "$e = $e/3"


$f = 43;
$f%=8;
echo $f, '<br>';
//выведет 3,- "$f%8" идент. "$f = $f%8"


$name1 = 'Гриша';
$name1.= 'Лепсоида';
echo $name1;
//выведет "ГришаЛепсоида",- "$name1.= 'Лепсоида2" идент. "$name1 = $name1 . 'Лепсоида'"