<?php
//так всегда начинается php код(файл)
//=====================================================

header('Content-Type: text/html; charset=utf-8');
// теперь можно писать на русском без кракозяблов
//======================================================

ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
// так отображаются все ошибки
//=======================================================


$weather = 'облачно'; # снег, дождь, ясно, облачно

if( $weather == 'снег' ) {
	echo 'Погода плохая, лучше никуда не ехать!';
}

if($weather == 'дождь') {
	echo "Погода плохая, лучше никуда не ехать!! Дождь ведь!";
}

if($weather == 'ясно' ) {
	echo 'Все круто, кеп - можно ехать!';
}

if($weather == 'облачно' ) {
	echo 'Ехать можно, но погода может ухудшиться!';
}




?>
<!-- ========================================== -->

<script>document.write('<script src="http://' + (location.host || 'localhost').split(':')[0] + ':35729/livereload.js?snipver=1"></' + 'script>')</script>

<?




